#### FabricationItemFolder Members

---

|  |
| --- |
| FabricationItemFolder Class   Methods   Properties   See Also |

The  FabricationItemFolder  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  FabricationItemFolder |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetItemFiles | Gets the item files in this item folder. |
| Public method | GetSubFolders | Gets the item folder's sub folders. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Name | The item folder's name. |

# See Also

FabricationItemFolder Class

Autodesk.Revit.DB Namespace